#+TITLE: Programable Tanks 2
#+AUTHOR: Ethan Smith
#+EMAIL: ethansmith.dev@gmail.com

#+STARTUP: logdone overview
#+TODO: TODO STARTED DOCUMENT | DONE CANCEL

*** DONE write unit tests for message functions
    CLOSED: [2024-05-18 Sat 22:26]
    - [X] scenario_tick
    - [X] player_update

      I am trying to use pipes to simulate the network connection:
      #+begin_src C
        #include <unistd.h>
        #include <stdio.h>
        #include <sys/socket.h>

        int main() {
            int fd[2];
            pipe(fd);

            write(fd[1], "hello world!", 13);
            close(fd[1]);

            char buf[50];
            read(fd[0], buf, 50);

            printf("i got: %s", buf);
            close(fd[0]);

            return 0;
        }
      #+end_src

      #+RESULTS:
      : i got: hello world!

      The solution is that ~send/recv~ are different than ~write/read~.  The
      former only works on sockets, while the latter will work on either sockets
      or files (supposedly).
    
** TODO [#C] vector types
   It is frustrating working with vectors that have a seemingly unknown type
   whenever you declare them.

   #+begin_src c
     struct some_type {
         struct vector* v1;
         struct vector* v2;
         struct vector* v3;
     }
   #+end_src

   When I look at my code 3 months after I wrote this, I have no idea what type
   v1, v2, and v3 are.  I know that they are vectors, but vectors of what?  At a
   minimum, I want something in the declaration that shows the element type of
   the vector.  Then I can cast the data to the correct type when I am using it.

   #+begin_src C :flags -I./common/include common/src/vector.c
     #include "vector.h"
     #include <stdio.h>

     int main() {
         struct vector* my_vec = make_vector(sizeof(int), 10);
         for (int i = 0; i < 10; i++)
             vec_push(my_vec, &i);

         for (int i = 0; i < vec_len(my_vec); i++) {
             printf("%i ", *(int*)vec_ref(my_vec, i));
         }

         printf("\n");
         return 0;
     }
   #+end_src

   #+RESULTS:
   : 0 1 2 3 4 5 6 7 8 9


